/*
 * Copyright (c) 2020-2021, RT-Thread Development Team
 *
 * SPDX-License-Identifier: LGPL-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2021/01/09     iamyhw       The first version.
 */

#include "pinyin.h"

//½«×Öµä/´Êµä°´ÕÕÊ××ÖÄ¸·ÖÀà,¿É¼Ó¿ì²éÕÒËÙ¶È
static const ime_dicts_t dicts_a[] =
{
    { "a", "°²°´°®°¢°µ°¡°£°­°¼°Â°¶°«°¸°³°¤°¦°º°±°·°¥ß¹àÄëçï¹" },
    { "ai", "°®°£°­°«°¤°¦°¥°§°¨°©°ª°¬°¯´ôÞßàÈàÉæÈè¨êÓíÁïÍö°" },
    { "an", "°²°´¹ã³§°µ°¶°¸°³°±°·°°ÚÏÛûÞîáíâÖèñï§ðÆ÷ö" },
    { "ang", "°º°¹°»" },
    { "ao", "°¼°Â°½°¾°¿°À°Á°Ã°ÄÏùÛêÞÖà»á®âÚåÛæÁæñéáñúòüöË÷¡÷é" },
    { RT_NULL, RT_NULL },
};
static const ime_dicts_t dicts_b[] =
{
    { "b", "²»²¿±¾±í°Ñ±ä±È²¢±ð°Ù±¨±£²¡±±±»²½±ß°Ë°ì²¼" },
    { "ba", "°Ñ°Ë°É°Í°Î°Ô°Õ°Ö°Ó°Å°Æ°Ç°È°Ê°Ì°Ï°Ð°ÒÜØÝÃá±å±îÙôÎöÑ÷É" },
    { "bai", "°Ù°×°Ü°Ú²®°Ø°Û°Ý°ÞÞãêþ" },
    { "ban", "°ì°ë°å°à°ã°æ°è°á°ß°â°é°ä°ç°ê°íÚæÛàîÓñ£ñ­ô²" },
    { "bang", "°ï°ô°î°ñ°ð°ò°ó°õ°ö°÷°ø°ùÝòäº" },
    { "bao", "±¨±£°ü°þ±¡°û±©±¦±¥±§±¬±¤°ú°ý±¢±ª±«ÝáæßìÒð±ñÙõÀöµ" },
    { "be", "±»ßÂ±¾±¶±¿±¼±±" },
    { "bei", "±±±»±¶±¸±³±²±´±­±°±¯±®±µ±·±¹±ºØÃÚéÚýÛýÝÉÝíßÂã£íÕðÇñØöÍ÷¹" },
    { "ben", "±¾±¼±½±¿ÛÎÛÐêÚï¼" },
    { "beng", "±Ã±À±Á±Â±Ä±ÅàÔê´" },
    { "bi", "±È±Ø±Ü±Õ±Ù±Ê±Ú±Û±Ï±Ë±Æ±Ò±Ç±Î±É±Ì±Í±Ð±Ñ±Ó±Ô±Ö±×±ÝØ°ÙÂÜêÝ©ÞµßÁßÙáùâØã¹ääå¨åöåþæ¾æÔèµî¯îéïõñÔóÙóëó÷ô°ôÅõÏ÷Â" },
    { "bian", "±ä±ß±ã±à±é±ç±â±æ±Þ±á±å±èØÒÛÍÜÐâíãêçÂì®ìÔí¾íÜñ¹ñÛòùóÖöý" },
    { "biao", "±í±ê±ë±ìæ»æôè¼ì©ì­ïÚïðñ¦ñÑ÷§÷Ô" },
    { "bie", "±ð±î±ï±ñõ¿" },
    { "bin", "±ö±ò±ó±ô±õ±÷ÙÏáÙçÍçãéÄéëë÷ïÙ÷Æ÷Þ" },
    { "bing", "²¢²¡±ø±ú±ù±û±ý±ü±þÙ÷ÚûÞð" },
    { "bo", "²¨²¥²®²¦²©²ª²µ²£²´²·²¤²§²«²¬²­²¯²°²±²²²³Ùñà£âÄéÞë¢íçîàð¾ô¤õËõÛ" },
    { "bu", "²»²¿²½²¼²¹²¶²·²¸²º²¾²Àß²åÍê³êÎîÐîßõ³" },
    { RT_NULL, RT_NULL },
};
static const ime_dicts_t dicts_c[] =
{
    { "c", "²ú³É³ö³¤´Ó´Ë³£´¦³µ³¡´«²É²ã³§²Å´Î³æ³ý²é²î" },
    { "ca", "²Áàêíå" },
    { "cai", "²É²Å²Ä²Ë²Æ²Ã²Ê²Â²Ç²È²Ì" },
    { "can", "²Î²Ð²Ï²Ó²Í²Ñ²Òåîæîè²ôÓ÷õ" },
    { "cang", "²Ø²Ö²Ô²Õ²×" },
    { "cao", "²Ý²Û²Ù²Ú²ÜàÐäîó©ô½" },
    { "ce", "²â²ß²à²á²Þâü" },
    { "cen", "á¯ä¹" },
    { "ceng", "²ã²ä" },
    { "cha", "²é²î²å²ì²è²æ²ç²ê²ë²í²ïÉ²ÔûàêâªâÇãâæ±è¾é«é¶éßïÊïïñÃ" },
    { "chai", "²î²ñ²ð²òÙ­îÎðûò²" },
    { "chan", "²úµ¥²ù²û²ó²ô²õ²ö²÷²ø²üÙæÚÆÝÛâÜâãäýå¤åîåñæ¿æöêèìøïâó¸õð" },
    { "chang", "³¤³£³¡³§³ª³¦²ý³«³¥³©²þ³¢³¨ÉÑÌÈØöÛËÜÉÝÅáäâêã®ãÑæ½æÏêÆë©öð" },
    { "chao", "³¯³¬³±³²³­³®³°³³³´´Â½Ëâ÷êËìÌñé" },
    { "che", "³µ³¹³ß³·³¶³¸³ºÛåíº" },
    { "chen", "³Â³Á³Æ³Ä³¾³¼³¿Éò³»³½³À³ÃØ÷ÚÈÚßÞÓàÁå·è¡é´í×ö³" },
    { "cheng", "³É³Ì³Æ³Ç³Ð³Ë³ÊÊ¢³Å³Ï³È³Í³Î³Ñ³Ò³ÓØ©ÛôàáèÇèßëóîªîñîõñÎòÉõ¨" },
    { "chi", "³Ö³ß³Ý³Ô³à³Ø³Ù³á³â³Ü³Õ³×³Ú³Û³Þ³ãÙÑÛæÜ¯ÜÝß³ßêà´àÍáÜâÁæÊë·í÷ð·ñ¡ñÝò¿ó¤ó×óøôùõØ÷Î" },
    { "chong", "ÖÖ³æÖØ³ä³å³çÓ¿³èÜûâçã¿ï¥ô©ô¾" },
    { "chou", "³é³ð³ô³ê³ë³ì³í³î³ï³ñ³ò³óÙ±àüã°ñ¬öÅ" },
    { "chu", "³ö´¦³ý³õ´¡´¥³þ³ú´¢Ðó³÷³ø³ù³û³ü´£´¤Ø¡Û»âðãÀç©èÆèúéËñÒòÜõé÷í" },
    { "chuai", "´§Þõà¨àÜëúõß" },
    { "chuan", "´«´¬´©´®´¨´ª´­â¶å×çÝë°îËô­" },
    { "chuang", "´²´´´°´³´¯´±âë" },
    { "chui", "´µ´¹´¸×µ´¶´·Úïé¢é³" },
    { "chun", "´º´¿´¼´»´½´¾´ÀÝ»ðÈòí" },
    { "chuo", "´Á´Âà¨ê¡õÖöº" },
    { "ci", "´Ë´Î´Ì´Å´Æ´Ê´Ä´Ã´Ç´È´É´ÍËÅ×ÈÜëßÚìôðËôÙ" },
    { "cong", "´Ó´Ô´Ï´Ð´Ñ´ÒÜÊäÈæõçýè®" },
    { "cou", "´Õé¨ê£ëí" },
    { "cu", "´Ö´Ù´×´Ø×äÝýáÞâ§éãõ¡õ¾õí" },
    { "cuan", "´Û´Ú´ÜÔÜÙàß¥ìàïé" },
    { "cui", "´ß´à´ã´â´ÝË¥´Þ´á´äÝÍßýã²è­éÁë¥ö¿" },
    { "cun", "´æ´å´ç¶×ââñå" },
    { "cuo", "´í´ë´é´è´ê´ìØÈáÏëâï±ïóðîðûõºõã" },
    { RT_NULL, RT_NULL },
};
static const ime_dicts_t dicts_d[] =
{
    { "d", "µÄ´óµØ¶¯µ½¶Ô¶È¶àµçµ³µÃ¶¨µÈ¶·µ±¶Ó¶¼µã´úµÀ" },
    { "da", "´ó´ò´ï´ð´îËþ´ñÞÇßÕàªâòæ§í³ðãñ×óÎ÷°÷²" },
    { "dai", "´ó´ú´ø´ý´ü´÷´ô´õ´ö´ù´û´þµ¡Ü¤ß°ß¾á·åÊææçªçé÷ì" },
    { "dan", "µ¥µ«µ¯µ£Ê¯µ°µ­µ¨µªµ¤µ©µ¢µ¦µ§µ¬µ®ÙÙÝÌà¢å£ééêæíñðãð÷ñõóì" },
    { "dang", "µ³µ±µµµ²µ´ÚÔÛÊÝÐå´í¸ñÉ" },
    { "dao", "µ½µÀµ¼µ¶µ¹µ¾µºµ·µ¸µ»µ¿ß¶àüâáë®ìâôî" },
    { "de", "µÄµÃµØµÂµ×ï½" },
    { "deng", "µÈµÆµÇµË³ÎµÅµÉµÊàâáØê­íãïëô£" },
    { "di", "µÄµØµÚµÍµÐµ×ÌáµÛµÖµÎµÜµÝµÌµÏµÑµÒµÓµÔµÕµÙµÞØµÙáÚ®ÚÐÛ¡ÛæÝ¶àÖæ·ç°èÜé¦êëíÆíÚíûïáôÆ÷¾" },
    { "dia", "àÇ" },
    { "dian", "µçµãµæµäµêµßµíµàµáµâµåµèµéµëµìµîÚçÛãáÛçèîäñ°ñ²ô¡õÚ" },
    { "diao", "µ÷µôµõÄñµïµðµñµòµóµöîöõõöô" },
    { "die", "µüµøµùµúµûµýµþÛìÜ¦Þéà©ëºð¬ñóõÚõÞöø" },
    { "ding", "¶¨¶¥¶¤¶¡¶©¶¢¶£¶¦¶§Øêà¤çàëëíÖî®îúðÛñôôú" },
    { "diu", "¶ªîû" },
    { "dong", "¶¯¶«¶¬¶®¶´¶³¶­¶°¶±¶²ÛíßËá´á¼ë±ëËëØíÏð´" },
    { "dou", "¶·¶¼¶¹¶Á¶µ¶¶¶¸¶º¶»Ýúñ¼ò½óû" },
    { "du", "¶È¶¼¶¾¶À¶Á¶É¶Å¶Â¶Æ¶Ù¶½¶¿¶Ã¶Ä¶Ç¶ÊÜ¶à½äÂèüë¹ó¼óÆ÷Ç÷ò" },
    { "duan", "¶Ï¶Ë¶Î¶Ì¶Í¶Ðé²ìÑóý" },
    { "dui", "¶Ô¶Ó¶Ñ¶Ø¶Òí¡í­íÔ" },
    { "dun", "¶Ü¶Ö¶Ù¶×¶Ø¶Õ¶Ú¶Û¶ÝãçìÀí»íâíïïæõ»" },
    { "duo", "¶à¶È¶á¶ä¶Þ¶ß¶â¶ã¶å¶æ¶ç¶è¶éÍÔßÍßáãõç¶èÞîìñÖõâ" },
    { RT_NULL, RT_NULL },
};
static const ime_dicts_t dicts_e[] =
{
    { "e", "¶ø¶þ¶û¶ù¶ñ¶î¶÷¶í¶ú¶ü¶ê¶ö¶ë¶ì¶ï¶ð¶ò¶ó¶ô¶õØ¬ÚÌÛÑÜÃÝ­ÝàßÀãµåíæ¹éîëñï°ïÉðÊò¦öù" },
    { "ei", "ÚÀ" },
    { "en", "¶÷ÝìÞô" },
    { "er", "¶ø¶þ¶û¶ù¶ú¶ü¶ý·¡Ù¦åÇçíîïð¹öÜ" },
    { RT_NULL, RT_NULL },
};
static const ime_dicts_t dicts_f[] =
{
    { "f", "·Ö·¢·½·¨·´·Å¸´·ç·À·Ç·þ·Ê¸±·Û¸®·ò¸º·â¸»·­" },
    { "fa", "·¢·¨·§·¦·¥·£·¤·©ÛÒíÀ" },
    { "fan", "·´·­·¶·¸·¹·±·º·¬·²·³·µ·ª·«·®·¯·°··Þ¬ÞÀá¦èóìÜî²õì" },
    { "fang", "·½·Å·À·Ã·¿·Ä·Â·Á·¼·¾·»ÚúáÝèÊîÕô³öÐ" },
    { "fei", "·Ç·Ê·É·Ï·Î·Ð·Æ·Ë·È·Ì·ÍÜÀáôã­äÇåúç³é¼ëèìéïÐðòòãóõôäö­öî" },
    { "fen", "·Ö·Û·Ü·Ý·à·×·Ò·ß·Ó·Ô·Õ·Ø·Ù·Ú·ÞÙÇå¯çãèûö÷÷÷" },
    { "feng", "·ç·â·ä·á·ì·å·æ·è·î·ã·é·ê·ë·í·ïÙºÛºÝ×ßôããí¿" },
    { "fou", "·ñó¾" },
    { "fu", "¸´·þ¸±¸®·ò¸º¸»¸½¸£·ü·û·ù¸¯¸¡¸¨¸¶¸¹¸¾·õ¸²·ö·ø¸µ·ð¸¿¸¸¸¥¸¦·ô·ú·ó·÷·ý¸¢¸¤¸§¸©¸ª¸«¸¬¸­¸°¸³¸·¸¼¸ÀÙëÙìÛ®Ü½ÜÀÜÞÜòÝ³ÝÊÞÔß»á¥âöäæåõæÚæâç¦ç¨èõêçìðíÉíêíëî·ïûð¥ò¶òÝòðòóôïõÃõÆöÖöû" },
    { RT_NULL, RT_NULL },
};
static const ime_dicts_t dicts_g[] =
{
    { "g", "¸ö¹ú¹¤¹ý¸ß¸É¹Ø¸÷¸ï¹«¸ù¸ü¸Ä¹Ü¹â¹ã¹û¸ñ¹²¸ã" },
    { "ga", "¼Ð¸Á¸Â¸ìÞÎæØæÙê¸îÅ" },
    { "gai", "¸Ä¸Ã¸Ç¸Å¸Æ¸È½æØ¤ÚëÛòê®êà" },
    { "gan", "¸É¸Ë¸Ð¸Ò¸Ï¸Ê¸Î¸Ñ¸Ì¸Í¸ÓÇ¬ÛáÜÕÞÏß¦ãïäÆä÷ç¤éÏêºí·ðáôû" },
    { "gang", "¸Õ¸Ö¸×¸Ù¸Ú¸Û¸Ü¸Ô¸Ø¿¸í°î¸óà" },
    { "gao", "¸ß¸ã¸æ¸å¸à¸Ý¸Þ¸á¸â¸äØºÚ¾Û¬Þ»çÉéÀéÂê½ï¯" },
    { "ge", "¸ö¸÷¸ïºÏ¸ñ¸î¸è¸ô¸Ç¸ç¸õ¸ó¸ê¸ð¸é¸ë¸ì¸í¸ò¿©ÒÙØªØîÛÁÛÙÜªàÃæüë¡ëõíÑïÓñËò¢ò´ô´÷À" },
    { "gen", "¸ù¸úØ¨Ý¢ßçôÞ" },
    { "geng", "¸ü¸û¾±¸ý¸þ¹¡¹¢¹£ßìâÙç®öá" },
    { "gong", "¹¤¹«¹²¹©¹¦¹¥ºì¹®¹±¹¯¹¬¹§¹¨¹ª¹­¹°çîëÅò¼ö¡" },
    { "gou", "¹»¹¹¹µ¾ä¹·¹³¹´¹º¹¶¹¸ØþÚ¸á¸åÜæÅçÃèÛêíì°óÑóô÷¸" },
    { "gu", "¹Ä¹Ì¹Å¹Ç¹Ê¹Ë¹É¹È¹À¹Í¹Â¹Ã¼Ö¹¼¹½¹¾¹¿¹Á¹ÆØÅÚ¬ÝÔßÉáÄãéèôéïêôêöëûì±î­î¹îÜïÀð³ðÀðóòÁôþõýöñ÷½" },
    { "gua", "¹Ò¹Î¹ÏÀ¨¹Ð¹Ñ¹ÓØÔÚ´ßÉèéëÒð»" },
    { "guai", "¹Ö¹Ô¹Õ" },
    { "guan", "¹Ø¹Ü¹Û¹Ù¹à¹á¹ß¹Ú¹Ý¹Þ¹×ÂÚÙÄÝ¸ÞèäÊîÂðÙñæ÷¤" },
    { "guang", "¹â¹ã¹äßÛáîèæë×" },
    { "gui", "¹æ¹ó¹é¹è¹í¹ì¹ê¹ð¹å¹ç¹ë¹î¹ï¹ñ¹ò¹ô¿þÈ²ØÐØÛâÑå³æ£èíêÁêÐð§óþöÙ÷¬" },
    { "gun", "¹ö¹õ¹÷ÙòçµíÞöç" },
    { "guo", "¹ú¹ý¹û¹ø¹ùÎÐ¹üÙåÛöÞâßÃàþáÆâ£é¤ë½ñøòäòå" },
    { RT_NULL, RT_NULL },
};
static const ime_dicts_t dicts_h[] =
{
    { "h", "ºÍ»áºó»¯ºÃºÏ»¹»îºÜ»ØºÅºÁ»¨»òº£»°ºì»ð»Æº¦" },
    { "ha", "¹þ¸òÏºîþ" },
    { "hai", "»¹º£º¦º¢º¡º¤º¥º§ºÙ¿ÈàËëÜõ°" },
    { "han", "º¬º¸ºµº°ººº®º¹º¯º«º¨º©ºªº­º±º²º³º´º¶º·ÚõÝÕÞþãÛå«êÏìÊñüò¥òÀ÷ý" },
    { "hang", "ÐÐº½º»º¼¿ÔÏïãìç¬çññþ" },
    { "hao", "ºÃºÅºÁºÄºÀºÂºÆ¸äº¾º¿ºÑÝïÞ¶àÆàãå©å°ê»ð©ò«òº" },
    { "he", "ºÍºÏºÓºÎºËºÕºÉºÖºÈºØºÇºÌÏÅºÐºÊºÑºÒºÔº×Ú­ÛÀÛÖàÀãØæüêÂîÁò¢òÂôç" },
    { "hei", "ºÚºÙ" },
    { "hen", "ºÜºÝºÛºÞ" },
    { "heng", "ÐÐºáºâºãºßºàÞ¿çñèì" },
    { "hong", "ºìºéºäºæºåºçºèºêºëÙäÙêÚ§Ý¦Þ®Þ°ãÈãü" },
    { "hou", "ºóºòºñºîºíºïºðÜ©ááåËðúóóô×ö×÷¿" },
    { "hu", "ºÍ»¤»¥ºþºô»§»¡ºõºúºý»¢ºöºËº÷Ï·ºøºùºûºü»£»¦Ùüßüàñá²â©âïã±ä°äïçúéÎéõì²ìÃìÎìæìèìïð­ðÀðÉð×óËõ­õú" },
    { "hua", "»¯»¨»°»®»¬»ª»­»©»«»íæèèëí¹îü" },
    { "huai", "»µ»³»®»´»±»²õ×" },
    { "huan", "»¹»·»»»¶»º»¼»Ã»À»¸»½»¾»¿»Á»ÂÛ¨Û¼ÝÈß§à÷âµä¡ä½äñå¾åÕçÙïÌöé÷ß" },
    { "huang", "»Æ»É»Ä»Ê»Å»È»Ç»Ë»Ì»Í»Î»Ï»Ð»ÑÚòáåäÒäêåØè«ëÁñ¥ó¨óòöü" },
    { "hui", "»á»Ø»Ò»Ó»Ô»ã»Ù»Û»Ö»æ»Ý»ÕÀ£¶é»²»×»Ú»Ü»Þ»ß»à»â»ä»åÚ¶ÜîÜöÞ¥ßÔßÜà¹ãÄä§ä«åççÀçõèíêÍí£ò³ó³÷â" },
    { "hun", "»ì»ë»ç»è»é»êÚ»âÆãÔäã" },
    { "huo", "ºÍ»î»ò»ð»õ»ñ»ï»ô»í»ó»öØåÞ½ß«àëâ·îØïÁïìñëó¶" },
    { RT_NULL, RT_NULL },
};
static const ime_dicts_t dicts_j[] =
{
    { "j", "¼¶¾Í½ø¼Ó¾­¼Ò½á½×¼ä¼þ¼°½â½Ï»ú¾ü½Ó½Ì¼«¾Å¼û" },
    { "ji", "¼¶¼°»ú¼«¼¸»ý¸ø»ùÆä¼Ç¼ºÆÚÏµ¸ï¼Æ¼¯¼´¼Ê¼¾¼¤¼Ã¼¼»÷¼Ì¼±¼Á¼È¼Í¼Ä¼·¼¦¼£¼¨ÆëÆæ¼ª¼¹¼­¼®¼²¼¡¼¬»û»ø»ü»þ¼¢¼¥¼§¼©¼³¼µ¼»¼½¼¿¼À¼Â¼Å¼É¼Ë½åØ¢Ø½ØÀØÞÙ¥ÙÊÚµÛÔÜ¸ÜÁÜùÝðÞªÞáß´ßÒßâßóá§áÕä©åìæ÷çÜçáé®éêêªê«êåêéê÷ì´í¶î¿ïúð¢ñ¤ò±óÅóÇôßõÒõÕö«öÝöê÷Ù÷ä" },
    { "jia", "¼Ó¼Ò¼Ü¼Û¼×¼Ð¼Ù¼Ø¼Ö¼Ú¼Ý¼Î¼Ï¼Ñ¼Ô¼Õ¼ÞÇÑÐ®ØÅÙ¤Û£Ýçáµä¤åÈçìê©ëÎí¢îòïØðèðýñÊòÌóÕôÂõÊ" },
    { "jian", "¼ä¼þ¼û½¨¼á¼õ¼ì¼ù¼â¼ò¼î¼ô¼è½¥¼ç¼ü½¡¼í¼ø½£¼ß¼à¼æÇ³¼é¼ý¼ë½¢¼ó¼ã¼å¼ê¼ï¼ð¼ñ¼ö¼÷¼ú½¤½¦½§ÙÔÚÉÚÙÝÑÝóÞöàîäÕå¿åÀçÌèÅé¥ê§ê¯êðêùë¦ëìíúïµðÏñÐóÈôåõÂõÝöä÷µ" },
    { "jiang", "½«½µ½²Ç¿½­½¬½¯½±½®½©½ª½°½³½´Üüä®ç­çÖêñíäñðôÝôø" },
    { "jiao", "½Ï½Ì½»½Ç½Ð½Å½º½½½¹¾õÐ£½Á½Í½¼½Â½Ñ½·½¸½¾½¿½À½Ã½Ä½Æ½È½É½Ê½Ë½ÎÙ®ÙÕÜ´ÜúÞØàÝá½áèäÐæ¯ë¸ð¨ðÔòÔõ´õÓöÞ" },
    { "jie", "½á½×½â½Ó½Ú¼Ò½ç½Ø½é½è¼Û½ì½Ö½Ò½à½Ü½ß½Ô½Õ½Ù½Û½Ý½Þ½ã½ä½å½æ½ê½ë¿¬ÙÊÚ¦ÚµÞ×à®àµæ¼æÝèîíÙðÜò¡ò»ôÉöÚ÷º" },
    { "jin", "½ø½ð½ü½ô½ï½ñ¾¡½ö¾¢½þ½û½ò½î½õ½ú½í½ó½÷½ù½ýÚáÝ£ÝÀàäâËâÛæ¡çÆèªéÈêáêîñÆ" },
    { "jing", "¾­¾«¾©¾¶¾®¾²¾¹¾§¾»¾³¾µ¾°¾¯¾¢¾¥¾´¾ª¾¦¾º¾£¾¤¾¨¾¬¾·¾¸ØÙÙÓÚåÝ¼â°ã½ãþåÉåòæºëÂëÖëæìºö¦" },
    { "jiong", "¾¼¾½åÄêÁìç" },
    { "jiu", "¾Í¾Å¾É¾¿¾Ã¾È¾Æ¾À¾¾¾Á¾Â¾Ä¾Ç¾Ê¾Ë¾Ì¾ÎÙÖà±ãÎèÑèêð¯ðÕôñ÷Ý" },
    { "ju", "¾ß¾Ý¾Ö¾Ù³µ¾ä¾Û¾à¾Þ¾Ó¾â¾ç¾Ø¾Ü¹ñ½Û¾Ï¾Ð¾Ñ¾Ò¾Ô¾Õ¾×¾Ú¾á¾ã¾å¾æÙÆÚªÜÄÜÚÜìÞäåáåðè¢èÛé§é°é·éÙêøì«îÒï¸ñÀñÕôòõ¶õáö´öÂöÄ÷¶" },
    { "juan", "¾í¾è¾é¾ê¾ë¾ì¾î¿¡Û²áúä¸èðîÃïÃïÔöÁ" },
    { "jue", "¾ö¾õ¾ø½Ç½Å¾ò½À¾ï¾ð¾ñ¾ó¾ô¾÷ØÊØãÚÜÛÇÞ§àµàÙàåáÈâ±æÞçåèöéÓìßïãõêõû" },
    { "jun", "¾ü¾ù¾ú¾ý¹ê¾û¾þ¿¡¿¢¿£¿¤¿¥ÞÜñäóÞ÷å" },
    { RT_NULL, RT_NULL },
};
static const ime_dicts_t dicts_k[] =
{
    { "k", "¿É¿ª¿´¿Ë¿×¿Æ¿Ú¿Õ¿à¿ì¿¼¿Ì¿¿¿ö¿éÀ§¿í¿ó¿¹¿¨" },
    { "ka", "¿¨¿¦¿§¿©ØûßÇëÌ" },
    { "kai", "¿ª¿­¿«¿¬¿®ØÜÛîÝÜâéâýîøï´ïÇ" },
    { "kan", "¿´¿¯¿²¼÷¿°¿±¿³Ç¶Ù©Ý¨ãÛê¬íèî«" },
    { "kang", "¿¹¿µ¿»¿¶¿·¿¸¿ºØøãÊîÖ" },
    { "kao", "¿¼¿¿¿½¿¾åêèàêûîí" },
    { "ke", "¿É¿Ë¿Æ¿Ì¿Í¿Ç¿Å¿Ã¿ÂºÇ¿À¿Á¿Ä¿È¿Ê¿Îà¾á³ã¡äÛæìç¼çæéðë´î§îÝï¾ïýðâñ½ò¤òò÷Á" },
    { "ken", "¿Ï¿Ð¿Ñ¿ÒñÌ" },
    { "keng", "¿Ó¿Ôï¬" },
    { "kong", "¿×¿Õ¿Ø¿ÖÙÅáÇóí" },
    { "kou", "¿Ú¿Û¿Ù¿ÜÜÒÞ¢ßµíîóØ" },
    { "ku", "¿à¿â¿Ý¿á¿Þ¿ß¿ãØÚÜ¥à·ç«÷¼" },
    { "kua", "¿ç¿ä¿å¿æ¿èÙ¨" },
    { "kuai", "»á¿ì¿é¿ê¿ëØáÛ¦ßàáöä«ëÚ" },
    { "kuan", "¿í¿î÷Å" },
    { "kuang", "¿ö¿ó¿ñ¿ò¿ï¿ð¿ô¿õÚ²Ú¿Ú÷ÛÛÞÅßÑæþêÜ" },
    { "kui", "¿üÀ£À¡¿÷¿ø¿ù¿ú¿û¿ý¿þÀ¢Ø¸ØÑÙçÚóÝÞÞñà­à°ã¦ã´åÓêÒî¥ñùòñóñõÍ" },
    { "kun", "À§À¥À¤À¦ã§ãÍçûï¿õ«öï÷Õ" },
    { "kuo", "À©À¨ÊÊÀ«ÀªèéòÒ" },
    { RT_NULL, RT_NULL },
};
static const ime_dicts_t dicts_l[] =
{
    { "l", "ÁËÀ´Á¿ÀíÂ·ÀïÂÛÁ½ÀûÁìÁ÷Á¦Á¢ÁÏÁ¬ÀÏÁùÂÖÀàÁÐ" },
    { "la", "À­ÂäÀ²À¯À°À¶À¬À®À±ØÝååê¹íÇðø" },
    { "lai", "À´ÀµÀ³áÁáâäµäþêãíùïªñ®ô¥" },
    { "lan", "À¼ÀÃÀ¶ÀÀÀ¸À·À¹ÀºÀ»À½À¾À¿ÀÁÀÂÀÄá°äíé­ìµî½ïçñÜ" },
    { "lang", "ÀËÀÊÀÉÀÇÀÅÀÆÀÈÝ¹Ýõà¥ãÏï¶ïüòë" },
    { "lao", "ÀÏÀÍÂäÀÎÀÔÀÌÂçÀÐÀÑÀÒÀÓÁÊßëáÀèáîîï©ðìñìõ²" },
    { "le", "ÁËÀÖÀÕÀßØìß·ãî÷¦" },
    { "lei", "ÀàÀ×ÀÛÀÕÀÝÀáÀØÀÙÀÚÀÜÀÞÀßÙúÚ³àÏæÐçÐéÛñçõª" },
    { "leng", "ÀäÀâÀãÜ¨ã¶" },
    { "li", "ÀíÀïÀûÁ¦Á¢ÀëÀýÀúÁ£ÀåÀñÀîÁ¥ÀèÁ§ÀøÀçÀæÀöÀ÷ÀéÀêÀìÀðÀòÀóÀôÀõÀùÀüÀþÁ¡Á¤Á¨ØªÙ³ÙµÛªÛÞÜÂÝ°ÝñÞ¼ß¿à¦à¬áûã¦äàå¢åÎæ²æËæêçÊèÀèÝéöìåíÂîºî¾ï®ð¿ðÝðßòÃòÛó»óÒóöôÏõ·õÈö¨öâ÷¯÷ó" },
    { "lia", "Á©" },
    { "lian", "Á¬ÁªÁ·Á¶Á³Á´Á«Á­Á®Á¯Á°Á±Á²ÁµÝüÞÆäòå¥çöé¬éçì¡ñÍñÏó¹öã" },
    { "liang", "Á¿Á½Á¸Á¼ÁÁÁºÁ¹Á¾Á»ÁÀÁÂÜ®Ý¹é£õÔö¦÷Ë" },
    { "liao", "ÁËÁÏÁÆÁÉÁÅÁÃÁÄÁÇÁÈÁÊÁÌÁÍÁÎÞ¤ÞÍàÚâ²å¼çÔîÉðÓ" },
    { "lie", "ÁÐÁÑÁÒÁÓÁÔÙýÛøÞæßÖä£ôóõñ÷à" },
    { "lin", "ÁÖÁ×ÁÙÁÚÁÜ÷ëÁÕÁØÁÛÁÝÁÞÁßÝþßøá×âÞãÁåàéÝê¥ì¢î¬ôÔõï" },
    { "ling", "ÁìÁíÁãÁîÁéÁëÁåÁäÁèÀâÁêÁàÁáÁâÁæÁçÛ¹ÜßßÊàòãöç±èÚèùê²ñöòÈôáöì" },
    { "liu", "Á÷ÁùÁôÁõÁòÁøÂ½ÁóÁöÁïÁðÁñÂµä¯åÞæòç¸ì¼ìÖï³ïÖðÒöÌ" },
    { "long", "ÁúÂ¢ÅªÁýÂ¡ÁûÁüÁþÂ£Â¤ÛâÜ×ãñççèÐëÊíÃñª" },
    { "lou", "Â©Â¶Â¥Â¦Â§Â¨ÂªÙÍÝäà¶áÐïÎðüñïò÷÷Ã" },
    { "lu", "Â·ÁùÂ¶Â¯Â½Â³Â¼Â¬Â«Â­Â®Â°Â±Â²Â´ÂµÂ¸Â¹ÂºÂ»Â¾ÛäÞ¤ß£ààãòäËäõåÖè´èÓéÖéñéûê¤ëªëÍïåðµðØóüôµöÔ" },
    { "lv", "ÂÊÂÌÂÉÂÇÂËÂÈÂÁÂÃÂÀÂ¿ÂÂÂÄÂÅÂÆãÌéµëöïùñÚ" },
    { "luan", "ÂÑÂÒÂÍÂÎÂÏÂÐÙõæ®èïð½öÇ" },
    { "lue", "ÂÔÂÓï²" },
    { "lun", "ÂÛÂÖÂ×ÂÕÂØÂÙÂÚàð" },
    { "luo", "ÂäÂÞÂÝÂåÂçÂß¿©ÀÓÂÜÂàÂáÂâÂãÂæÙÀÙùÜýÞÛÞûâ¤ãøäðçóé¡ëáíÑïÝñ§öÃ" },
    { RT_NULL, RT_NULL },
};
static const ime_dicts_t dicts_m[] =
{
    { "m", "ÃæÃüÃÇÃñÃ«Ã»Ã×Ã÷ÂíÃ´Ã¿ÃÅÃûÄ¥ÃÀÃÜÃçÂúÄ¶Ä¿ß¼" },
    { "ma", "ÂíÃ´ÂéÂðÂèÂîÂïÂëÄ¦Ä¨ÂêÂìßéáïæÖè¿ó¡" },
    { "mai", "ÂóÂöÂôÂòÂñÂõÛ½Ý¤ö²" },
    { "man", "ÂúÂýÂüÂþÂûÂ÷ÂøÂùÃ¡Ü¬á£çÏì×ïÜò©òý÷©÷´" },
    { "mang", "Ã¦Ã¢Ã¤Ã£Ã¥Ã§ÚøäÝíËòþ" },
    { "mao", "Ã«Ã¬Ã°Ã²Ã³Ã±Ã¨Ã©ÃªÃ­Ã®Ã¯ÙóÜâá¹ã÷è£êÄêóë£ì¸í®î¦ó±÷Ö" },
    { "me", "Ã´÷á" },
    { "mei", "Ã»Ã¿ÃÀÃºÃ¹Ã¸Ã·ÃÃÃ¼ÃµÃ¶Ã½Ã¾ÃÁÃÂÃÄÃÓÃÕÝ®áÒâ­ä¼äØé¹ïÑðÌñÇ÷È" },
    { "men", "ÃÇÃÅÃÆÞÑìËí¯îÍ" },
    { "meng", "ÃÏÃÍÃÉÃËÃÎÃÈÃÌÃ¥ÃÊÛÂÝùÞ«ãÂëüíæòµòì" },
    { "meng", "ó·ô»ô¿" },
    { "mi", "Ã×ÃÜÃÔÃÛÃØÃÐÃÑÃÒÃÓÃÕÃÖÃÙÃÚÃÝØÂÚ×ÞÂßäà×â¨ãèåµåôëßìòôÍôé÷ã÷ç" },
    { "mian", "ÃæÃÞÃâÃàÃßÃáÃãÃäÃåãæäÅäÏëïíí" },
    { "miao", "ÃçÃëÃèÃíÃîÃéÃêÃìß÷åãç¿çÑèÂíµíððÅ" },
    { "mie", "ÃðÃïØ¿ßãóºóú" },
    { "min", "ÃñÃôÃòÃóÃõÃöÜåáºãÉãýçÅçäçëíªö¼÷ª" },
    { "ming", "ÃüÃ÷ÃûÃùÃøÃËÃúÚ¤ÜøäéêÔî¨õ¤" },
    { "miu", "Ãý" },
    { "mo", "ÎÞÄ¥Ã»ÍòÄ©Ä£Ä¤ÃþÄ«Ä¦ÂöÄªÄ¨Ã°Ä¬ºÑºÙÄ¡Ä¢Ä§Ä­Ä®Ä¯Ä°ÚÓÜÔÝëâÉæÆéâïÒï÷ñ¢ñòõöõø" },
    { "mou", "Ä³Ä±Ä²Ù°ßèçÑíøòÖòúöÊ" },
    { "mu", "Ä¶Ä¿Ä¾Ä¸Ä¹Ä£Ä»ÄÁÄ·ÄÂÀÑÄ²Ä´ÄµÄºÄ¼Ä½ÄÀØïÛéÜÙãåë¤îâ" },
    { RT_NULL, RT_NULL },
};
static const ime_dicts_t dicts_n[] =
{
    { "n", "ÄêÄÜÄÚÄÇÅ©ÄãÄÏÄÑÄØÅ®ÄàÄÄÄÃÄîÅ£ÄþÄÔÕ³ÄáÄÉàÅ" },
    { "na", "ÄÇÄÏÄÄÄÃÄÉÄØÄÆÄÅÄÈÞàëÇïÕñÄ" },
    { "nai", "ÄÍÄÄÄÌÄËÄÊÄÎØ¾ÜµÝÁèÍ" },
    { "nan", "ÄÏÄÑÄÐà«àîàïéªëîòïôö" },
    { "nang", "ÄÒß­àìâÎêÙ" },
    { "nao", "ÄÔÄÖÅ¬ÄÓÄÕÄ×Ø«ÛñßÎâ®è§íÐîóòÍ" },
    { "ne", "ÄØÄÄÄÅÚ«" },
    { "nei", "ÄÚÄÇÄÄÄÙ" },
    { "nen", "ÄÛí¥" },
    { "neng", "ÄÜ" },
    { "ni", "ÄãÄàÄáÄØÄæÄâÄòÄÝÄÞÄßÄäÄåÄçÙ£Ûèâ¥âõêÇì»ìòí«íþîêöò" },
    { "nian", "ÄêÄîÕ³ÄèÄéÄëÄìÄíÄðØ¥Ûþéýð¤öÓöó" },
    { "niao", "ÄòÄñÄçÜàæÕëåôÁ" },
    { "nie", "ÄøÄöÄùÄóÄôÄõÄ÷Ø¿ÚíÞÁà¿ò¨ô«õæ" },
    { "nin", "Äú" },
    { "ning", "ÄþÄýÅ¡ÄûÄüÅ¢ØúÜÑßÌå¸ñ÷" },
    { "niu", "Å£Å¤Å¥Å¦ÞÖáðâîæ¤" },
    { "nong", "Å©ÅªÅ¨Å§Ù¯ßæ" },
    { "nou", "ññ" },
    { "nu", "Å«Å¬Å­åóæÀæÛæåí¤îÏô¬" },
    { "nv", "Å®" },
    { "nuan", "Å¯" },
    { "nue", "Å°Å±" },
    { "nuo", "ÅµÄÈÅ²Å³Å´ÙÐÞùßöï»" },
    { RT_NULL, RT_NULL },
};
static const ime_dicts_t dicts_o[] =
{
    { "o", "Å·Å¼Å¶Å¸Å¹ÅºÅ»Å½Ú©àÞâæê±ñî" },
    { "ou", "ÇøÅ·Å¼Å¸Å¹ÅºÅ»Å½Ú©âæê±ñî" },
    { RT_NULL, RT_NULL },
};
static const ime_dicts_t dicts_p[] =
{
    { "p", "ÅúÆ½ÅÐÅäÆ¬ÅÉÆÆÅÅÆ·Æ¤ÅçÅÌÆ«ÆÀÅÂÅàÆÕÆ¶ÅÜÅÚ" },
    { "pa", "ÅÂÅÉÅÀÅÁ°Ç°ÒÅ¾Å¿ÅÃÝâèËîÙóá" },
    { "pai", "ÅÉÅÅÅÄÅÆÆÈßßÅÇÅÈÙ½Ýå" },
    { "pan", "ÅÐÅÌÅÑ·¬ÅËÅÊÅÍÅÎÅÏÅÖÞÕãÝãúñÈñáó´õç" },
    { "pang", "ÅÔ°ò°õÅÒÅÓÅÕÅÖáÝäèåÌó¦" },
    { "pao", "ÅÜÅÚÅÙÅ×ÅÝÅØÅÛÞËáóâÒëãðå" },
    { "pei", "ÅäÅàÅãÅßÅÞÅáÅâÅåÅæàÎàúì·ïÂõ¬ö¬" },
    { "pen", "ÅçÅèäÔ" },
    { "peng", "ÅöÅïÅîÅóÅõÅòÅéÅêÅëÅìÅíÅðÅñÅôÜ¡àØâñó²" },
    { "pi", "ÅúÆ¤»µ·ñ±ÙÅ÷Æ¢Æ£ÅøÅùÅûÅüÅýÅþÆ¡Æ¥Æ¦Æ§Æ¨Æ©Ø§ØòÚéÚðÚüÛ¯ÛÜÛýÜ±ÜÅß¨ßÁàèâÏäÄæÇç¢èÁê¶î¢î¼îëñ±ñÔñâò·òçõù" },
    { "pian", "Æ¬Æ«±ãÆªÆ­±âÚÒæéçÂêúëÝôæõä" },
    { "piao", "Æ±Æ¯ÆÓÆ®Æ°ØâÝ³àÑæÎæôçÎéèî©óª" },
    { "pie", "Æ²Æ³Ø¯ÜÖë­" },
    { "pin", "Æ·Æ¶ÆµÆ´Æ»Æ¸ÞÕæ°æÉé¯êòò­" },
    { "ping", "Æ½ÆÀÆ¿Æ¾Æ»·ëÆ¹ÆºÆ¼ÆÁÙ·æ³èÒöÒ" },
    { "po", "ÆÆÆÈÆÂÆÃ·±ÆÓ²´ÆÄÆÅÆÇÆÉØÏÚéÛ¶ãøçêê·îÇîÞîàð«óÍ" },
    { "pou", "ÆÊÙöÞå" },
    { "pu", "ÆÕÆ×ÆËÆÒÆÌ±©ÆÏÆÓÆÑ±¤¸¬ÆÍÆÎÆÐÆÔÆÖÆØÆÙÙéàÛäßå§è±ë«ïäïèõë" },
    { RT_NULL, RT_NULL },
};
static const ime_dicts_t dicts_q[] =
{
    { "q", "ÆðÇ°ÆäÈ¥ÆøÈ«ÆÚÈºÇéÇøÇ¿ÇÐÈ¡ÆßÇóÇåÈ·È¨ÇÒÇà" },
    { "qi", "ÆðÆäÆøÆÚÆßÆ÷ÆëÆæÆûÆóÆáÆÛÆìÆèÆôÆúÆç»ü¼©ÆÜÆÝÆÞÆàÆâÆãÆåÆéÆêÆíÆîÆïÆñÆòÆõÆöÆùÆüÆýØ½ØÁÙ¹ÛßÜ»ÜÎÜùÝ½ÝÂÝÝÞ­àÒá¨áªá«ãàä¿æëç²ç÷çùè½èçéÊêÈì¥ì÷í¬íÓñýòÓòàôëôìõè÷¢÷è" },
    { "qia", "¿¨Ç¡ÆþÇ¢Ù¤ÝÖñÊ÷Ä" },
    { "qian", "Ç°Ç§Ç®Ç³Ç©Ç¨Ç¦Ç±Ç£Ç¯ÏËÇ´Ç¤Ç¥ÇªÇ«Ç¬Ç­Ç²ÇµÇ¶Ç·Ç¸Ù»ÙÝÚäÜ·ÜÍÜçÝ¡Þçá©ã¥ã»å¹åºå½ç×èýêùëÉí©îÔò¯óèóé" },
    { "qiang", "Ç¿½«Ç¹ÇÀÇ½Ç»ÇºÇ¼Ç¾ãÞæÍéÉê¨ìÁïºïÏïêñßòÞôÇõÄ" },
    { "qiao", "ÇÅÇÆ¿ÇÇÉÇÃÇÇ½¶ÇÁÇÂÇÄÇÈÇÊÇËÇÌÇÍÇÎÇÏÈ¸ØäÚ½ÚÛÜñá½ã¸ã¾çØéÔíÍõÎ÷³" },
    { "qie", "ÇÐÇÒÆöÇÑÇÓÇÔÙ¤Û§ã«ã»æªêüïÆóæ" },
    { "qin", "Ç×ÇÖÇÚÇØÇÕÇÙÇÛÇÜÇÝÇÞÇßÜËÞìßÄàºàßâÛäÚéÕï·ñæñûòûôÀ" },
    { "qing", "ÇéÇåÇàÇáÇãÇëÇ×ÇìÇâÇçÇäÇæÇèÇêÜÜàõéÑíàòßóÀóäôìö¥öë÷ô" },
    { "qiong", "ÇîÇíÚöÜäñ·òËóÌõ¼öÆ" },
    { "qiu", "ÇóÇòÇïÇð³ð¹êÇñÇôÇõÇöÙ´ÛÏáìäÐåÏåÙé±êäò°òÇòøôÃôÜöú÷ü" },
    { "qu", "È¥ÇøÈ¡ÇúÇÒÇþÇüÇ÷ÇýÈ¤ÇùÇûÈ¢È£ÐçÚ°Û¾ÜÄÞ¡Þ¾á«áéãÖè³êïë¬ëÔìîíáð¶ñ³òÐó½ôðöÄ÷ñ" },
    { "quan", "È«È¨È¦È°ÈªÈ©È§È¬È­È®È¯Ú¹Üõãªç¹éúî°îýòéóÜ÷Ü" },
    { "que", "È·È´È±È²È³ÈµÈ¶È¸ã×ãÚí¨" },
    { "qun", "ÈºÈ¹åÒ" },
    { RT_NULL, RT_NULL },
};
static const ime_dicts_t dicts_r[] =
{
    { "r", "ÈËÈçÈÕÈÏÈëÈÎÈÈÈ»ÈÝÈÃÈóÈõÈ¼È¾ÈÀÈÆÈÊÈÜÈÐÈÔ" },
    { "ran", "È»È¼È¾È½ÜÛòÅ÷×" },
    { "rang", "ÈÃÈÀÈÂÈ¿ÈÁìüð¦" },
    { "rao", "ÈÆÈÅÈÄÜéæ¬èã" },
    { "re", "ÈÈÈôÈÇ" },
    { "ren", "ÈËÈÏÈÎÈÊÈÐÈÌÈÉÈÍÈÑÈÒØðÜóÝØâ¿éíïþñÅ" },
    { "reng", "ÈÔÈÓ" },
    { "ri", "ÈÕ" },
    { "rong", "ÈÝÈÜÈÙÈÛÈÚÈÞÈÖÈ×ÈØÈßáÉáõéÅëÀòî" },
    { "rou", "ÈâÈàÈáôÛõå÷·" },
    { "ru", "ÈçÈëÈåÈéÈãÈäÈæÈèÈêÈìÝêÞ¸àéä²äáå¦çÈï¨ñàò¬" },
    { "ruan", "ÈíÈîëÃ" },
    { "rui", "ÈðÈñÈïÜÇÞ¨èÄî£ò¸" },
    { "run", "ÈóÈò" },
    { "ruo", "ÈõÈôÙ¼" },
    { RT_NULL, RT_NULL },
};
static const ime_dicts_t dicts_s[] =
{
    { "s", "ÊÇÉÏÊ±ÉúËµÉçÉîË®ËùÈýÊ®Ê¹ÊÂÊýËÄÊµÉÙÊ½É½ÊÖ" },
    { "sa", "ÈöÈøÈ÷Ø¦ØíêýëÛìª" },
    { "sai", "ÈûË¼ÈüÈùÈúàç" },
    { "san", "ÈýÉ¢ÈþÉ¡âÌë§ôÖ" },
    { "sang", "É£É¥É¤Þúíßòª" },
    { "sao", "É¨ÉÒÉ¦É§É©Ü£çÒçØëýðþöþ" },
    { "se", "É«ÈûÉªÉ¬ØÄï¤ð£" },
    { "sen", "É­" },
    { "seng", "É®" },
    { "sha", "É³É±É°É¶É´É¯É²ÉµÉ·É¼ÏÃßþàÄêýì¦ï¡ððôÄö®öè" },
    { "shai", "É«É¸É¹" },
    { "shan", "É½µ¥ÉÁÉÆÉºÉÈÉÂµ§É»É¼É¾É¿ÉÀÉÃÉÄÉÅÉÇÉÉÕ¤ØßÚ¨Û·ÛïÜÏäúæ©æÓæóëþìøîÌðÞóµô®õÇ÷­" },
    { "shang", "ÉÏÉÌÉËÉÐÌÀÉÊÉÍÉÎÉÑÛðç´éäìØõü" },
    { "shao", "ÉÙÉÕÉÔÉÜÕÙÉÚÉÒÇÊÉÓÉÖÉ×ÉØÉÛÛ¿Üæäûè¼òÙóâô¹" },
    { "she", "ÉçÉèÉäÉãÉàÕÛÉæÉáÉßÉÝÉÞÉâÉåØÇÙÜß¡â¦äÜì¨î´÷ê" },
    { "shen", "ÉîÉíÉñÊ²Éì²ÎÉõÉøÉòÉöÉóÉêÉ÷ÉéÉëÉïÉðÉôÚ·ÚÅÝ·ÝØßÓäÉé©ëÏïòò×" },
    { "sheng", "ÉúÊ¤ÉùÊ¡ÉýÊ¢ÉþÊ£Ê¥Éü³ËÉûáÓäÅêÉíòóÏ" },
    { "shi", "ÊÇÊ±Ê®Ê¹ÊÂÊµÊ½Ê¶ÊÀÊÔÊ¯Ê²Ê¾ÊÐÊ·Ê¦Ê¼Ê©Ê¿ÊÆÊªÊÊÊ³Ê§ÊÓÊÒÊÏËÆÊ´Ê«ÊÍÖ³Ê°ÊÎÊ»³×Ê¨Ê¬Ê­Ê¸ÊºÊÁÊÃÊÄÊÅÊÈÊÉÊËÊÌÊÑÐêÖÅÚÖÛõÝªÝéß±éøêÛìÂîæó§óÂóßõ§õ¹öåöõ" },
    { "shou", "ÊÖÊÜÊÕÊ×ÊØÊìÊÚÊÙÊÞÊÛÊÝá÷ç·ô¼" },
    { "shu", "ÊýÊéÊ÷ÊôÊõÊäÊöÊìÊøÊóÊèÊâÊæÊßÊíÊåÊðÊàÊáÊãÊçÊêÊëÊîÊïÊñÊòÊùÊúÊûÊüÊþË¡ÓáØ­Ù¿ÛÓÝÄÞóãðäøæ­ç£ë¨ëòì¯ïø" },
    { "shua", "Ë¢Ë£à§" },
    { "shuai", "Ë¥Ë§Ë¤Ë¦ó°" },
    { "shuan", "Ë¨Ë©ãÅäÌ" },
    { "shuang", "Ë«ËªË¬ãñæ×" },
    { "shui", "Ë®ËµË­Ë¯Ë°" },
    { "shun", "Ë³Ë±Ë²Ë´" },
    { "shuo", "ËµÊýË¶Ë·Ë¸ÝôÞ÷åùéÃîå" },
    { "si", "ËÄË¼ËÀË¹Ë¿ËÆË¾ËÇÊ³Ë½²ÞËºË»ËÁËÂËÃËÅËÈØËÙ¹ÙîÛÌßÐãáãôäùæ¦æáçÁìëïÈð¸ñêòÏóÓ" },
    { "song", "ËÉËÍËÎËÌËÊËËËÏËÐÚ¡Ý¿áÂáÔâìã¤äÁñµ" },
    { "sou", "ËÑËÒËÓËÔÛÅÞ´à²àÕâÈäÑì¬î¤ïËòô" },
    { "su", "ËØËÙËÕËÜËõË×ËßËÞËàËÖËÚËÛËÝÙíÚÕÝøà¼ãºä³óùö¢öÕ" },
    { "suan", "ËãËáËââ¡" },
    { "sui", "ËæËëËéËäËêÄòËåËçËèËìËíËîÚÇÝ´å¡åäìÝíõî¡" },
    { "sun", "ËðËïËñÝ¥áøâ¸é¾öÀ" },
    { "suo", "ËùËõËøË÷É¯ËòËóËôËößïàÂàÊæ¶èøêýíüôÈ" },
    { RT_NULL, RT_NULL },
};
static const ime_dicts_t dicts_t[] =
{
    { "t", "ËûÍ¬ËüÌáÌâÌåÍ¼ÌìÍ·Í¨ÌõÌØÍÁÍÅÍ³Ì¨ËýÌ«Ì×Ìú" },
    { "ta", "ËûËüËýËþÌ¤ËúÌ¡Ì¢Ì£ÍØàªãËäâäðåÝé½í³îèõÁ÷£" },
    { "tai", "Ì¨Ì«Ì¬Ì¥Ì§Ì©Ì¦ÌªÌ­Û¢Þ·ß¾ææëÄìÆîÑõÌöØ" },
    { "tan", "Ì¸Ì¼Ì½Ì¿µ¯Ì¹Ì°Ì²Ì®Ì¯Ì±Ì³Ì´ÌµÌ¶Ì·ÌºÌ»Ì¾Û°å£ê¼ìþîãïÄïâ" },
    { "tang", "ÌÃÌÇÌÆÌÁÌÀÌÂÌÄÌÅÌÈÌÉÌÊÌËÌÌÙÎàûäçè©éÌï¦ïÛñíó¥ó«ôÊõ±" },
    { "tao", "Ì×ÌÖÌÓÌÕÌÑÌÒÌÍÌÎÌÏÌÐÌÔØ»ß¶ßûä¬èºìâ÷Ò" },
    { "te", "ÌØß¯ìýí«ï«" },
    { "teng", "ÌÚÌÛÌÙÌÜëø" },
    { "ti", "ÌáÌâÌåÌæÌÝÌèÌÞÌßÌàÌãÌäÌçÌéÌêÌëÙÃÜèã©åÑç°ç¾ðÃñÓõ®" },
    { "tian", "ÌìÌïÌíÌîÌðµèÌñÌòÌóÞÝãÃãÙéåî±" },
    { "tiao", "Ìõµ÷ÌøÌôÌöÌ÷Ù¬Üæìöñ»òèóÔôÐö¶öæ÷Ø" },
    { "tie", "ÌúÌùÌûÝÆ÷Ñ" },
    { "ting", "ÌýÍ£Í¥Í¦Í¢ÌüÌþÍ¡Í¤Í§ÜðÝãæÃèèî®îúòÑöª" },
    { "tong", "Í¬Í¨Í³Í­Í´Í²Í¯Í°¶±¶²Í©ÍªÍ«Í®Í±Ù¡ÙÚÛíÜíàÌá¼âúäüíÅ" },
    { "tou", "Í·Í¶Í¸Íµî×÷»" },
    { "tu", "Í¼ÍÁÍ»Í¾Í½Í¹Í¿ÍÂÍÃÍÀÍºÜ¢Ý±ÝËîÊõ©" },
    { "tuan", "ÍÅÍÄÞÒåèî¶" },
    { "tui", "ÍÆÍËÍÈÍÇÍÉÍÊß¯ìÕ" },
    { "tun", "¶ÚÍÊÍÌÍÍÍÎÙÛâ½êÕëà" },
    { "tuo", "ÍÑÍÏÍÐÍ×ÍÖ¶æÆÇÍÒÍÓÍÔÍÕÍØÍÙØ±Ù¢ÛçâÕãûèØèÞéÒíÈîèóêõ¢õÉö¾" },
    { RT_NULL, RT_NULL },
};
static const ime_dicts_t dicts_w[] =
{
    { "w", "ÎªÎÒÎÞÎÊÍâÎåÎ»ÎïÎ¯ÍêÎÂÍòÎÄÍùÎäÎñÍõÎ§ÎóÍí" },
    { "wa", "ÍßÍÚ°¼ÍÛÍÜÍÝÍÞÍàØôæ´ëð" },
    { "wai", "ÍâÍá" },
    { "wan", "ÍêÍòÍíÍäÍëÍçÍåÍìÍæÂûÃäÍãÍèÍéÍîÍïÍðÍñÍóØàÜ¹Ý¸ÝÒæýçºçþëäîµòê" },
    { "wang", "ÍùÍõÍûÍøÍüÍýÍöÍúÃ¢ÍôÍ÷ØèÞÌã¯éþ÷Í" },
    { "wei", "ÎªÎ»Î¯Î§Î¬Î¨ÎÀÎ¢Î°Î´ÍþÎ£Î²Î½Î¹Î¶Î¸ÎºÎ±ÒÅÎ¥Î¤Î·Î³Î¡Î¦Î©Î«Î­Î®ÎµÎ¼Î¾Î¿ÙËÚÃÚñÚóÛ×ÝÚÞ±àíàøá¡áËáÍâ«â¬ãÇãíä¢ä¶åÔæ¸çâè¸ê¦ì¿ìÐðôôºöÛ" },
    { "wen", "ÎÊÎÂÎÄÎÈÎÆÎÅÎÃÎÁÎÇÎÉØØãÓãëè·ö©" },
    { "weng", "ÎËÎÌÎÍÝîÞ³" },
    { "wo", "ÎÒÎÕÎÑÎÏÎÐÎÖÎÎÎÔÎÓÙÁÝ«à¸á¢ä×ë¿íÒö»" },
    { "wu", "ÎÞÎåÎïÎäÎñÎóÎéÎèÎÛÎòÎíÎç¶ñÎÝÎÚÎâÍöÎÜÎÙÎ×ÎØÎßÎàÎáÎãÎæÎêÎëÎìÎîÎðØ£ØõÚãÚùÛØÜÌßíâÐâäâèä´å»åÃåüæÄæðè»êõì¶ìÉðÄðÍðíòÚöÈ÷ù" },
    { RT_NULL, RT_NULL },
};
static const ime_dicts_t dicts_x[] =
{
    { "x", "Ñ§ÏÂÐÐÐ¡ÏßÐÔÐÂÐ©ÏëÐÄÏòÏàÏµÏ¯ÏÖÎ÷ÐÞÏóÏÈÐÎ" },
    { "xi", "ÏµÏ¯Î÷Ï°Ï¸ÎüÎöÏ²Ï´Ï³Ï¡Ï·Ï¶Ï£Ï¢Ï®ÎýÏ©ÎþÏ¤Ï§ÏªÀ°ÆÜÎôÎõÎøÎùÎúÎûÏ¥Ï¦Ï¨Ï«Ï¬Ï­Ï±ÙÒÙâÚôÛ­ÜçÝ¾ÝßÝûÞÉßñáãâ¾ãÒä»äÀåïæÒçôéØêØêêì¤ì¨ìäìùìûðªñ¶ñÓòáó£ó¬ôªô¸ôËôÑôâõµõè÷û" },
    { "xia", "ÏÂÏÄÏÅÏÁÏ¼»£Ï¹ÏºÏ»Ï½Ï¾Ï¿ÏÀÏÃßÈáòåÚè¦èÔíÌðýóÁ÷ï" },
    { "xian", "ÏßÏÖÏÈÏØÏÞ¼ûÏÔÏÊÏ×ÏÕÏÝÏÜÏËÏ´ÏÆÏÒÏ³ÏÙÏÇÏÉÏÌÏÍÏÎÏÏÏÐÏÑÏÓÏÚÏÛÙþÜÈÝ²Þºá­áýåßæµë¯" },
    { "xiang", "ÏëÏòÏàÏóÏìÏîÏäÏç½µÏãÏñÏêÏðÏíÏæÏáÏâÏåÏèÏéÏïÜ¼ÝÙâÃâÔæøç½ó­öß÷Ï" },
    { "xiao", "Ð¡ÏûÏ÷Ð§Ð¦Ð£ÏúÏõÏôÐ¤Ð¢ÏöÏøÏùÏüÏýÏþÐ¥ßØáÅäìåÐæçç¯èÉèÕòÙóãóï÷Ì" },
    { "xie", "Ð©½âÐ´Ð±Ð»Ð­ÐµÒ¶ÑªÐ¶Ð¼Ð¬ÐªÐ°Ð²Ð·Ð¹ÐºÆõÐ¨Ð«Ð®Ð¯Ð³Ð¸ÙÉÙôÛÄÛÆÞ¯ß¢â³âÝäÍå¬åâç¥çÓé¿éÇò¡õó" },
    { "xin", "ÐÂÐÄÐÅÐ¿Ð¾ÐÁÑ°ÐÀÐ½ÐÃÐÆØ¶Ü°ê¿ì§ïâöÎ" },
    { "xing", "ÐÐÐÔÐÎÐÍÐÇÐËÊ¡ÐÑÐÕÐÒÐÈÐÉÐÊÐÌÐÏÐÓÚêÜôÜþß©â¼ã¬íÊ" },
    { "xiong", "ÐÛÐØÐÖÐ×ÐÜÐÙÐÚÜº" },
    { "xiu", "ÐÞÐâÐÝÐäÐãÐàËÞ³ôÐßÐáÐåßÝá¶âÊâÓäåð¼õ÷÷Û" },
    { "xu", "ÐøÐíÐëÐèÐòÐéÐõÐóÐðÐîÐ÷ÐìÐæÐçÐêÐïÐñÐôÐöÓõÚ¼ÛÃÛ×Þ£äªä°äÓçïèòìãí¹íìñãôÚõ¯" },
    { "xuan", "Ñ¡ÐýÐûÐüÐþÈ¯ÐùÐúÑ¢Ñ£Ñ¤ÙØÚÎÝæÞïãùäÖäöè¯é¸êÑìÅìÓíÛîçïàðç" },
    { "xue", "Ñ§ÑªÏ÷Ñ©Ñ¨Ñ¥Ñ¦ÚÊàåí´õ½÷¨" },
    { "xun", "ÑµÑ®Ñ¸Ñ¶Ñ°Ñ­Ñ²»ç¿£Ñ«Ñ¬Ñ¯Ñ±Ñ³Ñ´Ñ·ÙãÛ¨Û÷Ü÷Þ¦Þ¹á¾áßâ´âþä­ä±êÖñ¿õ¸öà" },
    { RT_NULL, RT_NULL },
};
static const ime_dicts_t dicts_y[] =
{
    { "y", "Ò»ÓÐÓÃÒªÒÔÓÚÒ²ÑùÒåÓëÓÉÑ¹Ô±ÔÂÒâÓÖÔËÔ­ÓÍÑé" },
    { "ya", "Ñ¹ÑÇÑ½ÑÀÑ¿ÑÅÑÁÑ¼Æ¥ÑºÑ»Ñ¾ÑÂÑÃÑÄÑÆÑÈØóÛëÞëá¬åÂæ«çðèâë²í¼íýðé" },
    { "yan", "ÑéÑÐÑÏÑÛÑÔÑÎÑÝÑÒÑØÑÌÑÓÑÚÑçÑ×ÑÕÑàÑÜÇ¦ÑÉÑÊÑËÑÍÑÑÑÖÑÙÑÞÑßÑáÑâÑãÑäÑåÑæÑèÒóØÉØÍØßÙ²ÙÈÙðÚÝÚçÛ±Û³Ü¾ÝÎáÃâûãÆãÕäÎäÙåûæÌçüéÜêÌëÙëçìÍî»óÛõ¦÷Ê÷Ð÷ú" },
    { "yang", "ÑùÑøÑõÑïÑóÑôÑòÑíÑëÑîÑöÑêÑìÑðÑñÑ÷Ñúáàâóãóì¾ìÈí¦òÕ÷±" },
    { "yao", "ÒªÒ©Ô¼Ò¡ÑüÒ§ÑûÒ«ÌÕ½ÄÅ±ÑýÑþÒ¢Ò£Ò¤Ò¥Ò¦Ò¨Ô¿Ø²Ø³ßºáÊáæçÛçòèÃé÷ê×ëÈï¢ðÎñºôí÷¥" },
    { "ye", "Ò²ÒµÒ³Ò¶ÒºÒ¹Ò°Ò¯Ò±Ð°»©ÑÊÒ¬Ò­Ò®Ò´Ò·Ò¸×§ØÌÚËÚþÞÞêÊìÇîô" },
    { "yi", "Ò»ÒÔÒåÒâÒÑÒÆÒ½ÒéÒÀÒ×ÒÒÒÕÒæÒìÒËÒÇÒÚÒÅÒÁÒÛÒÂÒÉÒàÒêÒíÒëÒÖÒäÒßÒ¼Ò¾Ò¿ÒÃÒÄÒÈÒÊÒÌÒÍÒÎÒÏÒÐÒÓÒØÒÙÒÜÒÝÒÞÒáÒãÒçÒèÒîÒïØ×ØæØîØýÙ«Ú±ÛÝÛüÜ²ÜÓÜèÞ²ÞÄÞÈÞÚß®ß½ß×ßÞàÉàæá»áÚâ¢âÂâøâùã¨äôåÆæäçËéìéóêÝì¥ì½ìÚíôîÆï×ïîðêðùñ¯ñ´òæô¯ôàôèôý÷ð" },
    { "yin", "ÒòÒýÒõÓ¡ÒôÒøÑÌÒþÒûÒñÒðÒóÒöÒ÷ÒùÒúÒüØ·Û´ÛßÛóÜ§ÜáßÅà³áþâ¹ä¦äÎë³î÷ñ«ñ¿ò¾ö¯ö¸" },
    { "ying", "Ó¦Ó°Ó²ÓªÓ¢Ó³Ó­Ó£Ó¤Ó¥Ó§Ó¨Ó©Ó«Ó¬Ó®Ó¯Ó±ÙøÛ«ÜãÜþÝºÝÓÝöÞüàÓâßäÞäëå­çøè¬éºëôðÐñ¨ò£ó¿" },
    { "yo", "ÓýÓ´à¡" },
    { "yong", "ÓÃÓÂÓÀÓµÓ¿Ó¼Ó¹Ó¶Ó·Ó¸ÓºÓ»Ó½Ó¾ÓÁÙ¸ÛÕÜ­à¯ã¼çßïÞð®÷«÷Ó" },
    { "you", "ÓÐÓÉÓÖÓÍÓÒÓÑÓÅÓ×ÓÎÓÈÓÕÓÌÓÄÓÆÓÇÓÊÓËÓÏÓÓÓÔØÕØüÙ§Ý¬Ý¯ÝµÞÌßÏàóå¶èÖéàë»îððàòÄòÊòöòøôíöÏ÷î÷ø" },
    { "yu", "ÓÚÓëÓýÓãÓêÓñÓàÓöÔ¤ÓòÓïÓúÓæÓèÓðÓÞÓù¹ÈÓûÓîÎµÎ¾ÓØÓÙÓÛÓÜÓÝÓßÓáÓâÓäÓåÓçÓéÓìÓíÓóÓôÓõÓ÷ÓøÓüÓþÔ¡Ô¢Ô£Ô¥Ô¦ÖàØ®Ø¹ØñÙ¶ÚÄÚÍÝÇÝÒÝ÷ÞíàôàöáÎáüâÀâÅâ×ãÐå÷åýæ¥æúè¤êÅêìëéëòì£ì¶ìÏìÙìÛí²îÚðÁðÖðõðöñ¾ñÁòâòõóÄô§ô¨ö§ö¹" },
    { "yuan", "Ô±Ô­Ô²Ô´ÔªÔ¶Ô¸ÔºÔµÔ®Ô°Ô¹Ô§Ô¨Ô©Ô«Ô¬Ô¯Ô³Ô·ÛùÜ«Ü¾Þòà÷ãäæÂè¥éÚë¼íóð°ó¢óîö½" },
    { "yue", "ÔÂËµÔ½Ô¼ÀÖÔ¾Ô»ÔÄÔ¿ÔÀÔÁÔÃÙßå®èÝéÐë¾îá" },
    { "yun", "ÔËÔ±ÔÆÔÈ¾ùÔÊÔÐÔÅÔÇÔÉÔÌÔÍÔÎÔÏÛ©Ü¿áñã¢ã³ç¡è¹éæêÀëµìÙ" },
    { RT_NULL, RT_NULL },
};
static const ime_dicts_t dicts_z[] =
{
    { "z", "ÔÚÕâÖ÷ÖÐÖÖ×ÅÕùÕ½×÷ÕýÖ®ÖÆÖØ×éÖÎÖ»×Ó×ÔÖÊÖ¸" },
    { "za", "ÔÓÔúÔÛÔÑÔÒÕ¦ßÆ" },
    { "zai", "ÔÚÔÙÔØÔÔÔÖ×ÐÔÕÔ×áÌçÞ" },
    { "zan", "ÔÞÔÛÔÝÔÜÞÙè¶êÃô¢ôØôõöÉ" },
    { "zang", "²ØÔàÔáÔßÞÊæàê°" },
    { "zao", "ÔìÔçÔâÔïÔäÔãÔæÔíÔåÔèÔéÔêÔëÔîßð" },
    { "ze", "ÔòÔñÔð²àÔóÕ¦ØÆØÓßõàýåÅê¾óÐóåô·" },
    { "zen", "ÔõÚÚ" },
    { "zeng", "ÔöÔø×ÛÔ÷ÔùçÕêµîÀï­" },
    { "zha", "²éÔúÕ¨Õ¢Õ¡ÔþÔüÀ¯ÔûÔýÕ£Õ¤Õ¥Õ¦Õ§Õ©×õÞêß¸ßåßîà©é«íÄðäòÆ÷þ" },
    { "zhai", "Õ¯²àÔñÕªÕ­Õ«µÔ¼ÀÕ¬Õ®íÎñ©" },
    { "zhan", "Õ½Õ¹Õ¾Õ¼Õ³²üÕ°Õ±Õ²Õ´ÕµÕ¶Õ·Õ¸ÕºÕ»Õ¿ÕÀÚÞÞøì¹" },
    { "zhang", "³¤ÕÅÕÂÕÆÕÌÕÏÕÍÕÇÕËÕÁÕÃÕÄÕÈÕÉÕÊÕÎØëÛµá¤áÖâ¯æÑè°ó¯" },
    { "zhao", "×ÅÕÕÕÒÕÐ³¯ÕÙÕÔ×¦ÕÖÕÓÕ×³°ÕÑÕØÚ¯ßúèþîÈóÉ" },
    { "zhe", "Õâ×ÅÕßÕÛÕÜÕãÕÚÕÝÕÞÕàÕáÚØß¡èÏéüíÝðÑñÞòØô÷" },
    { "zhen", "ÕæÕëÕóÕòÕñÕðÕäÕïÕåÕçÕèÕéÕêÕìÕíÕîÛÚÝèä¥äÚçÇèåé©é»éôêâëÓëÞìõî³ð¡ð²óð" },
    { "zheng", "ÕùÕýÕþÕûÖ¤Õ÷ÕôÖ¢¶¡Ö£ÕõÕöÕøÕúÕüÖ¡Úºá¿áçîÛï£óÝ" },
    { "zhi", "Ö®ÖÆÖÎÖ»ÖÊÖ¸Ö±Ö§Ö¯Ö¹ÖÁÖÃÖ¾ÖµÖªÊ¶Ö´Ö°Ö²Ö½ÖÂÖ¦Ö³Ö¬ÖÇÊÏÖ«ÖÈÖ·ÖÍÖ­Ö¥Ö¨Ö©Ö¶ÖºÖ¼Ö¿ÖÀÖÄÖÅÖÉÖËÖÌÖÏØ´ÚìÛ¤ÛúÜÆÞýàùáçâååéåëæïèÎè×èÙèäéòéùêÞëÕëùìíìóíéïôðºðëòÎôêõ¥õÅõÙõÜõôö£" },
    { "zhong", "ÖÐÖÖÖØÖÚÖÓÖÕÖÒÖ×ÖÙÖÑÖÔÚ£âìïñó®ô±õà" },
    { "zhou", "ÖáÖÜÖÞÖÝÖåÖèÖÛÖßÖàÖâÖãÖäÖæÖçÝ§ßúæ¨æûç§ëÐíØô¦ôíôü" },
    { "zhu", "Ö÷×¢Öø×¡ÖúÖíÖýÊôÖêÖþÖùÊõ×¤Öð×£ÖñÖüÖéÖìÖîÖëÖïÖòÖóÖôÖõÖöÖûØùÙªÛ¥Üïä¨ä¾äóèÌéÆéÍìÄîùðæðññÒóÃóçô¶ôãõî÷æ" },
    { "zhua", "×¥ÎÎ" },
    { "zhuai", "×ªÒ·×§" },
    { "zhuan", "×ª×¨´«×©×«×¬×­ßùâÍãçò§" },
    { "zhuang", "×°×´×³×¯×²´±×®×±Ù×ÞÊ" },
    { "zhui", "×·×¶×µ×¸×¹×ºã·æíçÄ" },
    { "zhun", "×¼ÍÍ×»ëÆñ¸" },
    { "zhuo", "×ÅÖø×½×À½É×¾×¿×Á×Â×Ã×Ä×Æ×ÇÙ¾ÚÂßªä·äÃåªèþìÌìúí½ïí" },
    { "zi", "×Ó×Ô×Ê×Ö×Ï×Ð×Ñ×ËÖ¨×È×É×Ì×Í×Î×Ò×ÕÚÑÜëßÚáÑæ¢æÜç»è÷ê¢êßí§íöïÅïöñèóÊôÒôôõþö¤ö·öö÷Ú" },
    { "zong", "×Ü×Ý×Ú×Û×Ø×××ÙÙÌèÈëêôÕ" },
    { "zou", "×ß×Þ×à×áÚÁÚîÛ¸æãöí" },
    { "zu", "×é×å×ã×è×æ×â×ä×çÙÞÝÏïß" },
    { "zuan", "×ê×¬×ëß¬çÚõò" },
    { "zui", "×î×ï×ì¶Ñ¾××íÞ©" },
    { "zun", "×ð×ñß¤é×÷®" },
    { "zuo", "×÷×ö×ó×ù×ø×ò´éÔä´ê×Á×ô×õÚèßòàÜâôëÑìñóÐ" },
    { RT_NULL,  RT_NULL },
};

static const ime_dicts_t **dict_list[26] =
{
    dicts_a, dicts_b, dicts_c, dicts_d, dicts_e, dicts_f, dicts_g,
    dicts_h, RT_NULL, dicts_j, dicts_k, dicts_l, dicts_m, dicts_n,
    dicts_o, dicts_p, dicts_q, dicts_r, dicts_s, dicts_t,
    RT_NULL, RT_NULL, dicts_w, dicts_x, dicts_y, dicts_z
};

//Çë×Ô¼ºÌí¼ÓÈÈ´Ê!
static const ime_terms_t terms_a[] =
{
    { "ay", 2, "°¥Ñ½,°¢ÒÌ" },
    RT_NULL,
};
static const ime_terms_t terms_b[] =
{
    { "bm", 2, "±¦Âí" },
    RT_NULL,
};
static const ime_terms_t terms_c[] =
{
    { "cf", 2, "´¦·½" },
    { "chuf", 2, "´¦·½,³ý·¨,´¦·£,³ö·¢,´¥·¢,³ý·Ç,³ø·¿,´¦·Ö" },
    { "chufa", 2, "´¦·½,´¥·¢,³ö·¢,´¦·£,³ý·¨" },
    { "chufan", 2, "´¦·½,´¥·¸,³õ·¸,³ö·¹" },
    { "cfy", 3, "´¦·½Ò©" },
    { "chufy", 3, "´¦·½Ò©" },
    { "chufangy", 3, "´¦·½Ò©" },
    { "chufang", 2, "´¦·½,³ø·¿,³ö·Ã,³õ·À" },
    { "ck", 2, "²Î¿¼" },
    RT_NULL,
};
static const ime_terms_t terms_d[] =
{
    { "dc", 2, "¶¯³µ" },
    RT_NULL,
};
static const ime_terms_t terms_e[] =
{
    { "ey", 2, "öùÓã" },
    RT_NULL,
};
static const ime_terms_t terms_f[] =
{
    { "fg", 2, "·¢¹â" },
    RT_NULL,
};
static const ime_terms_t terms_g[] =
{
    { "gx", 2, "¸ßÐË,¸ãÐ¦,¸ßÐ§,¸ßÐÂ" },
    RT_NULL,
};
static const ime_terms_t terms_h[] =
{
    { "hs", 2, "ºìÉ«,ºéË®" },
    RT_NULL,
};
static const ime_terms_t terms_j[] =
{
    { "jd", 2, "¼¦µ°,¼òµ¥" },
    RT_NULL,
};
static const ime_terms_t terms_k[] =
{
    { "kl", 2, "¿ìÀÖ,¿¼ÂÇ" },
    RT_NULL,
};
static const ime_terms_t terms_l[] =
{
    { "ll", 2, "ÀíÂÛ,Á¦Á¿,ÁÄÁÄ" },
    RT_NULL,
};
static const ime_terms_t terms_m[] =
{
    { "mb", 2, "Ã÷°×,Ä¿±ê,Ãæ°ü" },
    RT_NULL,
};
static const ime_terms_t terms_n[] =
{
    { "nn", 2, "ÄãÄØ,ÄÐÅ®" },
    RT_NULL,
};
static const ime_terms_t terms_o[] =
{
    { "oo", 2, "Å¶Å¶,àÞàÞ" },
    RT_NULL,
};
static const ime_terms_t terms_p[] =
{
    { "pp", 2, "Æ¥Åä,ÆÅÆÅ" },
    RT_NULL,
};
static const ime_terms_t terms_q[] =
{
    { "qq", 2, "ÇëÇó,Ç°ÆÚ" },
    RT_NULL,
};
static const ime_terms_t terms_r[] =
{
    { "rm", 2, "ÈËÃñ,ÈËÃÇ" },
    RT_NULL,
};
static const ime_terms_t terms_s[] =
{
    { "ss", 2, "ÊÔÊÔ,ÊÂÊµ" },
    RT_NULL,
};
static const ime_terms_t terms_t[] =
{
    { "td", 2, "Í¨µÀ,Ì¬¶È" },
    RT_NULL,
};
static const ime_terms_t terms_w[] =
{
    { "wm", 2, "ÎÒÃÇ,ÍâÃæ" },
    RT_NULL,
};
static const ime_terms_t terms_x[] =
{
    { "xpx", 3, "ÐÜÆ×Ïè,Ð¡ÅÖÐÜ" },
    { "xw", 2, "Ï£Íû,ÐÐÎª" },
    { "xz", 2, "ÏÖÔÚ,ÏÂÔØ" },
    RT_NULL,
};
static const ime_terms_t terms_y[] =
{
    { "yx", 2, "Ò»ÏÂ,ÓÎÏ·" },
    RT_NULL,
};
static const ime_terms_t terms_z[] =
{
    { "zhrm", 4, "ÖÐ»ªÈËÃñ,×ß»ðÈëÄ§"},
    { "zhrmghg", 7, "ÖÐ»ªÈËÃñ¹²ºÍ¹ú,"},
    { "zhrmghggg", 9, "ÖÐ»ªÈËÃñ¹²ºÍ¹ú¹ú¸è,"},
    { "zx", 2, "Ö´ÐÐ,Ö÷Ï¯,ÕâÐ©,×ÜÏß,ÏÖÔÚ,ÖÐÐÄ,×îÐÂ,×ÉÑ¯,×ÐÏ¸,×ÔÐÐ,Ö»Ðè,ÔÚÏß,×°ÐÞ,ÖÐÑ§" },
    RT_NULL,
};


static const ime_terms_t **dict_terms[26] =
{
    terms_a, terms_b, terms_c, terms_d, terms_e, terms_f, terms_g,
    terms_h, RT_NULL, terms_j, terms_k, terms_l, terms_m, terms_n,
    terms_o, terms_p, terms_q, terms_r, terms_s, terms_t,
    RT_NULL, RT_NULL, terms_w, terms_x, terms_y, terms_z
};

rt_inline int isLower(char c)
{
    return (c >= 'a' && c <= 'z');
}
rt_inline int isUpper(char c)
{
    return (c >= 'A' && c <= 'Z');
}
rt_inline int isLetter(char c)
{
    return (isLower(c) || isUpper(c));
}
rt_inline int isNumber(char c)
{
    return (c >= '0' && c <= '9');
}
rt_inline char toLower(char c)
{
    return (isUpper(c) ? (c + 32) : c);
}
rt_inline char toUpper(char c)
{
    return (isLower(c) ? (c - 32) : c);
}

static ime_dicts_t *pinyin_get_dict(char c)
{
    ime_dicts_t *pin = RT_NULL;

    if (isLower(c)) pin = dict_list[c - 'a'];
    else if (isUpper(c)) pin = dict_list[c - 'A'];

    return pin;
}

ime_terms_t *pinyin_get_terms(char *ptr)
{
    ime_terms_t *tem = RT_NULL;

    if (isLower(*ptr)) tem = dict_terms[*ptr - 'a'];
    else if (isUpper(*ptr)) tem = dict_terms[*ptr - 'A'];

    int len = rt_strlen(ptr);

    while (tem->pin && tem->ci)
    {
        if (rt_strlen(tem->pin) == len)
        {
            if (rt_strcmp(tem->pin, ptr) == 0) return tem;
        }
        tem++;
    }
    return RT_NULL;
}

//Í³¼ÆÒÔ','·Ö¸ôµÄ´ÊÓïµÄÌõÊý
rt_uint16_t terms_len(char *ci)
{
    rt_uint16_t len = 0;
    char *sc = ci;
    while (*sc)
    {
        if (*sc == ',') len++;
        sc++;
    }

    if (*(sc - 1) != ',') len++;

    return len;
}

//È¥³ý×Ö·û´®ÖÐÖ¸¶¨µÄ×Ö·û
void string_remove_space(char *str, char c)
{
    char *s = str;
    int i, j = 0;
    for (i = 0; str[i] != '\0'; i++)
    {
        if (str[i] != c) s[j++] = str[i];
    }
    s[j] = '\0';

    str = s;
}
static void pinyin_update_zhbuf(input_method_t *ime)
{
    ime_dicts_t *py = ime->dicts;
    rt_uint16_t *buf = ime->zhbuf;
    rt_uint16_t len = 0;

    ime->zhlen = 0;

    if (!py) return;

    while (py->pin && py->hz)
    {
        if (rt_strlen(py->pin) == ime->inlen)
        {
            if (rt_strcmp(py->pin, ime->inbuf) == 0)
            {
                len = rt_strlen(py->hz);
                rt_memcpy(ime->zhbuf, py->hz, len);
                ime->zhlen = len / 2;
                ime->page_numbs = (ime->zhlen + (IME_WPP - 1)) / IME_WPP;
                ime->page_index = 0;
                ime->wordcnt = 1;
                ime->type = IME_TYPE_DICTS;
                return;
            }
        }
        py++;
    }

    ime_terms_t *tem = ime->terms;
    if (tem == RT_NULL) return;

    if (ime->zhlen == 0) //ÔÚ"×Öµä"ÖÐÎ´ÕÒµ½,ÔÙ²éÕÒ"´Êµä"
    {
        if (rt_strlen(tem->pin) == ime->inlen)
        {
            if (rt_strcmp(tem->pin, ime->inbuf) == 0)
            {
                len = rt_strlen(tem->ci);
                rt_memcpy(ime->zhbuf, tem->ci, len);
                string_remove_space(ime->zhbuf, ' '); //È¥³ý¿Õ¸ñ
                ime->zhlen = terms_len(tem->ci);
                ime->wordcnt = tem->cnt;
                ime->cnt_per_page = 12 / ime->wordcnt;
                ime->page_numbs = (ime->zhlen + (ime->cnt_per_page - 1)) / ime->cnt_per_page;
                ime->type = IME_TYPE_TERMS;
            }
        }
    }
}

void pinyin_generate_page(input_method_t *ime)
{
#define S ime->s

    if (ime->zhlen == 0) return;
    rt_memset(S, 0, sizeof(S));

    if (ime->type == IME_TYPE_DICTS) //×Öµä
    {
        rt_uint16_t *p = ime->zhbuf;

        if (((ime->page_index + 1) * IME_WPP) < ime->zhlen)
            ime->cnt_cur_page = IME_WPP;
        else
            ime->cnt_cur_page = ime->zhlen - ime->page_index * IME_WPP;
        if (ime->cnt_cur_page == 0) return;
        p += ime->page_index * IME_WPP;
        for (int i = 0; i < ime->cnt_cur_page; i++) 
        {
            rt_memcpy(S[i], p + i, 2);
            sprintf(ime->wordstr, "%s%d.%s ", ime->wordstr, i+1, S[i]);
        }
    }
    else //if(ime->type==IME_TYPE_TERMS) ´Êµä
    {
        char *p = ime->zhbuf;
        rt_uint16_t start = 0, index = 0;

        if (((ime->page_index + 1) * ime->cnt_per_page) < ime->zhlen)
            ime->cnt_cur_page = ime->cnt_per_page;
        else
            ime->cnt_cur_page = ime->zhlen - ime->page_index * ime->cnt_per_page;
        if (ime->cnt_cur_page == 0) return;
        start = ime->page_index * ime->cnt_per_page;
        while (*p)
        {
            if (index == start) break;
            if (*p == ',') index++;
            p++;
        }

        for (int i = 0; i < ime->cnt_cur_page; i++)
        {
            rt_memcpy(S[i], p, ime->wordcnt * 2);
            sprintf(ime->wordstr, "%s%d.%s ", ime->wordstr, i+1, S[i]);
            while (*p)
            {
                if (*p == ',' || *p == ' ')
                {
                    p++;
                    break;
                }
                p++;
            }
        }
    }
}

void pinyin_getout_zhstring(input_method_t *ime, char *zhstr, int index)
{
    if (index < 0  || index >= ime->cnt_cur_page) return;

    if (ime->type == IME_TYPE_DICTS)
    {
        rt_uint16_t *p = ime->zhbuf;
        p += ime->page_index * IME_WPP;

        if (index > ime->cnt_cur_page) return;
        rt_memcpy(zhstr, p + index, 2);
    }
    else
    {
        char *p = ime->zhbuf;
        rt_uint16_t start = 0, k = 0;

        if (index > ime->cnt_cur_page) return;
        rt_memcpy(zhstr, ime->s[index], ime->wordcnt * 2);
    }
}

void pinyin_getin_letter(input_method_t *ime, char c)
{
    if(ime->inlen >= 9) return; //×î´óÔÊÐí¼üÈë9¸ö
    ime->inbuf[ime->inlen++] = toLower(c);
    if (ime->inlen == 1) //search dict list
    {
        ime->dicts = pinyin_get_dict(c);
    }
    ime->terms = pinyin_get_terms(ime->inbuf);
    rt_memset(ime->zhbuf, 0, IME_ZHBUF_MAX);
    pinyin_update_zhbuf(ime);

    if(ime->zhlen >= IME_ZHBUF_MAX) //ÅÐ¶Ï×Öµä´óÐ¡ÊÇ·ñºÏ·¨
        rt_kprintf("The dictionary cache set is too small!\n");

    rt_memset(ime->wordstr, 0, IME_WORDSTR_SZ);
    pinyin_generate_page(ime);
}

void pinyin_backspace(input_method_t *ime)
{
    if (ime->inlen > 0)
    {
        ime->inlen--;
        ime->inbuf[ime->inlen] = 0;
        rt_memset(ime->zhbuf, 0, IME_ZHBUF_MAX);

        if (ime->inlen == 0)
        {
            ime->dicts = RT_NULL;
            ime->terms = RT_NULL;
        }
        else
        {
            ime->terms = pinyin_get_terms(ime->inbuf);
        }
        pinyin_update_zhbuf(ime);
        ime->page_numbs = (ime->zhlen + 8) / 9;
        rt_memset(ime->wordstr, 0, IME_WORDSTR_SZ);
        pinyin_generate_page(ime);
    }
}

void pinyin_page_add(input_method_t *ime)
{
    if (ime->page_numbs > 1)
    {
        if (ime->page_index > 0)
            ime->page_index -= 1;
        rt_memset(ime->wordstr, 0, IME_WORDSTR_SZ);
        pinyin_generate_page(ime);
    }
}

void pinyin_page_sub(input_method_t *ime)
{
    if (ime->page_numbs > 1)
    {
        if ((ime->page_index + 1) < ime->page_numbs)
            ime->page_index += 1;
        rt_memset(ime->wordstr, 0, IME_WORDSTR_SZ);
        pinyin_generate_page(ime);
    }
}

void pinyin_init(input_method_t *ime)
{
    rt_memset(ime, 0, sizeof(input_method_t));
}
